---
kind: type
id: T:Autodesk.Revit.UI.Result
source: html/e6cebb3c-0c3f-7dc4-2063-e5df0a00b2f5.htm
---
# Autodesk.Revit.UI.Result

Informs Autodesk Revit of the status of your application after execution.

## Syntax (C#)
```csharp
public enum Result
```